# SetLocalPlacement Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCreationData..::..SetLocalPlacement Method
IFCExtrusionCreationData Class See Also
---
Sets the data to reference an IfcLocalPlacement handle when creating the extrusion. Side effect: will set ReuseLocalPlacement to true.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void SetLocalPlacement(
	IFCAnyHandle localPlacement
)
```

Visual Basic
---
```text
Public Sub SetLocalPlacement ( _
	localPlacement As IFCAnyHandle _
)
```

Visual C++
---
```text
public:
void SetLocalPlacement(
	IFCAnyHandle^ localPlacement
)
```

# ### Parameters
localPlacement
    Type: Autodesk.Revit.DB.IFC..::..IFCAnyHandle The IfcLocalPlacement handle.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace